Tekla Open API Reference for Tekla Structures 2025
ControlPoint Properties
The ControlPoint type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Point
 Gets or sets the position of the control point.
Top
See Also
Reference
ControlPoint Class
Tekla.Structures.Model Namespace